<a href="https://colab.research.google.com/github/louis8ok1/Data_preprocessing/blob/master/data_preprocessing_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. 缺失值處理

In [1]:
import numpy as np
import pandas as pd
from sklearn import datasets
from io import StringIO

In [2]:
csv_data = '''A,B,C,D,E
        5.0,2.0,3.0,,6
        1.0,6.0,,8.0,5
        0.0,11.0,12.0,4.0,5
        3.0,,3.0,5.0,
        5.0,1.0,4.0,2.0,4
      '''

In [3]:
df = pd.read_csv(StringIO(csv_data))
df

     A     B     C    D    E
0  5.0   2.0   3.0  NaN  6.0
1  1.0   6.0   NaN  8.0  5.0
2  0.0  11.0  12.0  4.0  5.0
3  3.0   NaN   3.0  5.0  NaN
4  5.0   1.0   4.0  2.0  4.0

## 處理NAN方法一:使用Pandas去空值的方法“dropna”
### Def: dropna()預設只要任一ROW有空值就會整筆刪掉

In [4]:
df.dropna()

     A     B     C    D    E
2  0.0  11.0  12.0  4.0  5.0
4  5.0   1.0   4.0  2.0  4.0

把how設為all，就是要全部為空才清掉

In [5]:
df.dropna(how='all')

     A     B     C    D    E
0  5.0   2.0   3.0  NaN  6.0
1  1.0   6.0   NaN  8.0  5.0
2  0.0  11.0  12.0  4.0  5.0
3  3.0   NaN   3.0  5.0  NaN
4  5.0   1.0   4.0  2.0  4.0

In [ ]:
用subset指定當某一COW為空時才刪。

In [7]:
df.dropna(subset=['C'])

     A     B     C    D    E
0  5.0   2.0   3.0  NaN  6.0
2  0.0  11.0  12.0  4.0  5.0
3  3.0   NaN   3.0  5.0  NaN
4  5.0   1.0   4.0  2.0  4.0

## 處理NAN方法二:使用fillna function

直接填補0

In [8]:
df.fillna(0)

     A     B     C    D    E
0  5.0   2.0   3.0  0.0  6.0
1  1.0   6.0   0.0  8.0  5.0
2  0.0  11.0  12.0  4.0  5.0
3  3.0   0.0   3.0  5.0  0.0
4  5.0   1.0   4.0  2.0  4.0

某cow使用平均數

注意:分母不會算上NAN，所以這裡分母=4

In [11]:
df['D']=df['D'].fillna(df['D'].mean())
df

     A     B     C     D    E
0  5.0   2.0   3.0  4.75  6.0
1  1.0   6.0   NaN  8.00  5.0
2  0.0  11.0  12.0  4.00  5.0
3  3.0   5.0   3.0  5.00  NaN
4  5.0   1.0   4.0  2.00  4.0

Mode:出現最多次的數

In [16]:
df['C']=df['C'].fillna(df['C'].mode())
df

     A     B     C     D    E
0  5.0   2.0   3.0  4.75  6.0
1  1.0   6.0   NaN  8.00  5.0
2  0.0  11.0  12.0  4.00  5.0
3  3.0   5.0   3.0  5.00  NaN
4  5.0   1.0   4.0  2.00  4.0

# 2.類別資料處理

如果是Male,Female,Not Specified 這三種是等價關係，並不能知道他們的大小順序關係，那就是透過一種方法讓這三個屬性距離到原點是相同距離。--此方法就是**One-hot encoding**

In [20]:
df2=pd.DataFrame(
    [['green','M','10.1',1],
     ['red','L','13.5',2],
     ['blue','XL','15.3',1],
     ]
)
df2.columns = ['color','size','price','classlabel']
df2

   color size price  classlabel
0  green    M  10.1           1
1    red    L  13.5           2
2   blue   XL  15.3           1

In [21]:
size_mapping = {
    'XL':3,
    'L':2,
    'M':1
}
df2['size']=df2['size'].map(size_mapping)
df2

   color  size price  classlabel
0  green     1  10.1           1
1    red     2  13.5           2
2   blue     3  15.3           1

至於color我們就用onehot-encoding的方法來處理，在pandas裡面要使用onehot-encoding使用get_dummies這個函式就可以了

get_dummies = Convert categorical variable into dummy/indicator variables.

In [22]:
pd.get_dummies(df2['color'])

   blue  green  red
0     0      1    0
1     0      0    1
2     1      0    0

In [24]:
onehot_encoding = pd.get_dummies(df2['color'],prefix = 'color')
df2 = df2.drop('color', 1 )
df2

   size price  classlabel
0     1  10.1           1
1     2  13.5           2
2     3  15.3           1

In [26]:
pd.concat([onehot_encoding,df2],axis=1)

   color_blue  color_green  color_red  size price  classlabel
0           0            1          0     1  10.1           1
1           0            0          1     2  13.5           2
2           1            0          0     3  15.3           1